_posts/2014-03-19-emacs.html
---
layout: post
category: computer science and enginneering
title: "emacs knowledge"
description: ""
tags: ["tools"]
---
{% include JB/setup %}
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">C-u M-! &lt;shell-command&gt;</h2>
<div class="outline-text-2" id="text-1">
<p>
which runs the same shell-command function, and also inserts the
output back at the point in the current buffer. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Rectangles</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://www.delorie.com/gnu/docs/emacs/emacs_68.html">emacs manual's Rectangle operators</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Keyboard Macros</h2>
<div class="outline-text-2" id="text-3">
<p>
举例： 将下面的列宽增加3个空格
</p>
<div class="org-src-container">

<pre class="src src-sh">-rwxrwxr-x. 1 abelard abelard_signal
-rw-rw-r--. 1 abelard abelard_signal.c
-rwxrwxr-x  1 abelard abelardt
-rw-rw-r--. 1 abelard abelardbuteTest.c
drwxrwxr-x  3 abelard abelard
</pre>
</div>

<p>
步骤：
</p>

<ul class="org-ul">
<li>`C-x (’ or &lt;f3&gt; 定一个kbd宏
</li>
<li>'C-s 空格 搜索空格，光标将停在第1行的‘1’字符上
</li>
<li>移动光标，让其停在最后一行‘3’的前面
</li>
<li>'C-x r t RET 3spaces RET， 将得到第1列和第2列之间增加3个空格
</li>
<li>将光标停在第1行的‘1’上
</li>
<li>`C-x )’ or &lt;f4&gt;– 停止定义kbd宏
</li>
<li>将光标停在第1行的‘1’右侧的空格上，执行C-x e, 将在2和3列之间增加3 空格
</li>
<li>移动光标到第3列右侧的空格上，执行C-x e
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">-rwxrwxr-x.   1   abelard   abelard_signal
-rw-rw-r--.   1   abelard   abelard_signal.c
-rwxrwxr-x    1   abelard   abelardt
-rw-rw-r--.   1   abelard   abelardbuteTest.c
drwxrwxr-x    3   abelard   abelard
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">useful functions</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>M-x imenu jump to function definition
</li>
<li>M-x occur given an regex, it will create a new buffer with each
match in the current buffer
</li>
<li>C-x C-x go back to where you were
</li>
</ul>
</div>
</div>
